{
  "@context": "https://schema.org",
  "@graph": [
    {
      "@type": "Organization",
      "@id": "https://kreativespace.com/#organization",
      "name": "Kreativespace",
      "url": "https://kreativespace.com/",
      "logo": {
        "@type": "ImageObject",
        "url": "https://d35z3dfm220p5l.cloudfront.net/4x_Kiwi.png"
      },
      "sameAs": [
        "",
        "",
        "https://www.linkedin.com/company/kreativespace-ai/"
      ]
    },
    {
      "@type": "WebSite",
      "@id": "https://kreativespace.com/#website",
      "url": "https://kreativespace.com/",
      "name": "Kreativespace",
      "publisher": {
        "@id": "https://kreativespace.com/#organization"
      },
      "potentialAction": {
        "@type": "SearchAction",
        "target": "https://kreativespace.com/?s={search_term_string}",
        "query-input": "required name=search_term_string"
      }
    },
    {
      "@type": "WebPage",
      "@id": "https://kreativespace.com/#webpage",
      "url": "https://kreativespace.com/",
      "name": "Kreativespace - AI Writing Platform",
      "description": "Kreativespace is an online writing platform with 8 powerful tools for content creation, rewriting, grammar checking, plagiarism checking, and more.",
      "breadcrumb": {
        "@type": "BreadcrumbList",
        "itemListElement": [
          {
            "@type": "ListItem",
            "position": 1,
            "name": "Home",
            "item": "https://kreativespace.com/"
          }
        ]
      },
      "isPartOf": {
        "@id": "https://kreativespace.com/#website"
      },
      "about": {
        "@id": "https://kreativespace.com/#organization"
      }
    },
    {
      "@type": "FAQPage",
      "@id": "https://kreativespace.com/#faqpage",
      "mainEntity": [
        {
          "@type": "Question",
          "name": "What is Kreativespace?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "Kreativespace is an online writing platform with eight main tools like content creation, rewriting, plagiarism checking, grammar correction, and more. Instead of opening multiple different websites, all tools are available in one place. It is made for anyone who writes regularly including students and freelancers."
          }
        },
        {
          "@type": "Question",
          "name": "How is Kreativespace different from other writing platforms?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "Most writing websites either restrict everything behind a paywall or only offer one or two tools. Kreativespace gives access to all key writing tools in one account with a higher limit even on the free plan. The cost is lower than most paid tools while still producing more accurate results for writing."
          }
        },
        {
          "@type": "Question",
          "name": "Is Kreativespace free to use for students?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "Yes. The free plan is available to everyone. You get a limited number of words each month and access to seven out of eight tools. Students can use it without any ID or verification, which makes it easy for everyday school or college use."
          }
        },
        {
          "@type": "Question",
          "name": "How does the AI detector work?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The AI detector looks at how the text is written. It checks patterns like repetition or unnatural structure. If a text looks like it might be generated by a computer, it marks it as AI-written. It does not collect personal identity or any private details."
          }
        },
        {
          "@type": "Question",
          "name": "Is there a word-count limit on the free plan?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "Yes. The free plan has a monthly word limit. You can use the tools until your word quota is finished. After that, you either wait for next month, or upgrade to use more without stopping."
          }
        },
        {
          "@type": "Question",
          "name": "How do I sign up?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "You go to the Kreativespace website and create an account using your email. The process takes about a minute. Your account starts on the free plan without needing any payment information."
          }
        },
        {
          "@type": "Question",
          "name": "Do I get all 8 tools in the free plan?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "The free plan allows you to use seven tools. One advanced tool stays locked unless you upgrade to premium. Once you upgrade, you get all eight tools plus a higher word limit and priority access."
          }
        },
        {
          "@type": "Question",
          "name": "Can I use Kreativespace on my phone?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "Yes. You can open the website from any phone or tablet and log in normally. It works fine in a mobile browser so you can write or generate content from anywhere without any app."
          }
        },
        {
          "@type": "Question",
          "name": "Is my data safe on Kreativespace?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "Your writing remains private and is not shared or stored permanently. The platform uses a safe connection and does not sell your content. Anything you type or paste is used only to generate the result and then removed."
          }
        },
        {
          "@type": "Question",
          "name": "How can I cancel or pause my premium plan?",
          "acceptedAnswer": {
            "@type": "Answer",
            "text": "You can cancel the premium plan at any time in your account settings. If you cancel within five days of payment, you can request a full refund. Refunds usually take up to seven working days. If you want to pause instead of canceling completely, you can contact support and they will assist."
          }
        }
      ]
    }
  ]
}